// Написать программу, которая из имеющегося массива строк формирует маасив строк,
// длина которых меньше либо равна 3 символа

Console.WriteLine("Введите строковый массив через пробел");
string line = Console.ReadLine();
string [] array = line.Split(' ');
string [] array1 = new string[8];
int j = 0;


